# vstGetDataString

## Description
```pascal
PROCEDURE vstGetDataString(
				inDataID    : LONGINT;
				VAR outData : DYNARRAY[] of CHAR;
				VAR result  : BOOLEAN);
```

```python

def vs.vstGetDataString(inDataID):
    return (outData, result)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inDataID|LONGINT||
|outData|DYNARRAY[] of CHAR||
|result|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events